РазрешенияНаБСП24/src/Documents/Разрешения/Разрешения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Разрешения</name>
  <registerRecords>AccumulationRegister.ОстаткиПоКвоте</registerRecords>
  <attributes>
    <name>SenderCRO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReceiverLAB</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ПринимающаяЛаборатория</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegisatrationLetterNr</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Issued</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Valid</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrialPermit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Issued2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StudyNumber</name>
    <type>
      <types>CatalogRef.Протоколы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ambient</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Frozen</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Chilled</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Requesters</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comments</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Closed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПредупреждения</name>
    <type>
      <types>EnumRef.ТипыПредупреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ClearanceДепо</name>
    <type>
      <types>EnumRef.ClearanceДепо</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписант</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Города</name>
    <attributes>
      <name>Город</name>
      <type>
        <types>CatalogRef.Города</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Образцы</name>
    <attributes>
      <name>Образец</name>
      <type>
        <types>CatalogRef.Образцы</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбразца</name>
      <type>
        <types>EnumRef.ТипыОбразцов</types>
      </type>
    </attributes>
    <attributes>
      <name>Квота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйОстаток</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НулевойОстаток</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РазрешенияНаБСП24/src/AccumulationRegisters/ОстаткиПоКвоте/ОстаткиПоКвоте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПоКвоте</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Образец</name>
    <type>
      <types>CatalogRef.Образцы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОбразца</name>
    <type>
      <types>EnumRef.ТипыОбразцов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрешение</name>
    <type>
      <types>DocumentRef.Разрешения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

РазрешенияНаБСП24/src/InformationRegisters/УведомлениеПоОстаткамКвоты/УведомлениеПоОстаткамКвоты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УведомлениеПоОстаткамКвоты</name>
  <resources>
    <name>МинимальныйОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НулевойОтстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Разрешение</name>
    <type>
      <types>DocumentRef.Разрешения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Образец</name>
    <type>
      <types>CatalogRef.Образцы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОбразца</name>
    <type>
      <types>EnumRef.ТипыОбразцов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РазрешенияНаБСП24/src/Documents/Разрешения/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОстаткиПоКвоте.Записывать = Истина;
	Движения.ОстаткиПоКвоте.Очистить();
	Для Каждого ТекСтрокаОписаниеОбразцов Из Образцы Цикл
		Движение = Движения.ОстаткиПоКвоте.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Образец = ТекСтрокаОписаниеОбразцов.Образец;
		Движение.ТипОбразца = ТекСтрокаОписаниеОбразцов.ТипОбразца;
		Движение.Разрешение = Ссылка;
		Движение.Количество = ТекСтрокаОписаниеОбразцов.Квота;
	КонецЦикла;
	Движения.Записать();

	НаборЗаписей = РегистрыСведений.УведомлениеПоОстаткамКвоты.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Разрешение.Установить(Ссылка);
	Если Не Closed Тогда
		Для каждого ТекСтрокаОбразцов Из Образцы Цикл
			НоваяЗапись = НаборЗаписей.Добавить(); 
			НоваяЗапись.Разрешение = Ссылка; 
			НоваяЗапись.Образец = ТекСтрокаОбразцов.Образец; 
			НоваяЗапись.ТипОбразца = ТекСтрокаОбразцов.ТипОбразца;
			НоваяЗапись.МинимальныйОстаток = ТекСтрокаОбразцов.МинимальныйОстаток;
			НоваяЗапись.НулевойОтстаток = ТекСтрокаОбразцов.НулевойОстаток;
		КонецЦикла; 
	КонецЕсли; 
	НаборЗаписей.Записать(); 	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ТипПредупреждения = ПредопределенноеЗначение("Перечисление.ТипыПредупреждения.ПустаяСсылка");
	
	НаборЗаписей = РегистрыСведений.УведомлениеПоОстаткамКвоты.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Разрешение.Установить(Ссылка); 
	НаборЗаписей.Записать(); 	

КонецПроцедуры

#КонецОбласти
